// Обработка проведения документа.
//
// Параметры:
//  Отказ  - Булево - отказ от проведения.
//  Режим  - Булево - режим проведения (истина — проведение, ложь — отмена проведения).
Процедура ОбработкаПроведения(Отказ, Режим) 
	
	// регистр ТоварыНаСкладах Приход
	// регистр ЦеныНоменклатуры
	Движения.ТоварыНаСкладах.Записывать = Истина; 
	Движения.ЦеныНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Склад = Склад;
		Движение.Товар = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
		Движение = Движения.ЦеныНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.ВидЦены= Справочники.ВидЦеныНоменклатуры.Поступления;
		Движение.Цена = ТекСтрокаТовары.Цена;
		
	КонецЦикла;
	
КонецПроцедуры
