 //Процедура обрабатывает проведение документа «Реализация», формируя движения по регистру накопления
 //«ТоварыНаСкладах» для списания товаров с склада и егистру "Продажи" для учета суммовых показателей. При проведении в режиме «Оперативный» проверяет
 //наличие достаточных остатков на момент проведения и при выявлении дефицита устанавливает отказ от проведения,
 //выводя пользователю сообщения о недостающих количествах каждого товара.
 //Параметры:
 // Отказ - Булево - признак отказа от проведения документа (устанавливается в Истина при обнаружении отрицательных остатков).
 // РежимПроведения - Строка - режим проведения документа (определяет период проверки остатков).
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//1. Получить данные документа
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТовары.Номенклатура КАК Номенклатура,
		|	СУММА(РеализацияТовары.Количество) КАК Количество,
		|	РеализацияТовары.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВТ_ТоварыДокумента
		|ИЗ
		|	Документ.Реализация.Товары КАК РеализацияТовары
		|ГДЕ
		|	РеализацияТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТовары.Номенклатура,
		|	РеализацияТовары.Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыДокумента.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыДокумента.Количество КАК Количество,
		|	ВТ_ТоварыДокумента.Сумма КАК Сумма
		|ИЗ
		|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	//2. Записать движения в регистр (списать остатки)
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Склад = Склад;
		Движение.Товар = Выборка.Номенклатура;
		Движение.Количество = Выборка.Количество;
		
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Склад = Склад;
		Движение.Товар = Выборка.Номенклатура;
		Движение.Контрагент = Контрагент;
		Движение.Сумма = Выборка.Сумма;
		Движение.Количество = Выборка.Количество;
	КонецЦикла;  
	
	Движения.ТоварыНаСкладах.Записать(); 
	Движения.Продажи.Записать(); 
	
	//3. Прочитать остатки и проверить не ушли ли мы в минус
	Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Товар КАК Товар,
		|	-ТоварыНаСкладахОстатки.КоличествоОстаток КАК Дефицит,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТоварыНаСкладахОстатки.Товар) КАК ТоварПредставление
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			&Период,
		|			(Склад, Организация, Товар) В
		|				(ВЫБРАТЬ
		|					&Склад,
		|					&Организация,
		|					ВТ_ТоварыДокумента.Номенклатура КАК Номенклатура
		|				ИЗ
		|					ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента)) КАК ТоварыНаСкладахОстатки
		|ГДЕ
		|	ТоварыНаСкладахОстатки.КоличествоОстаток < 0";

	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		Период = '00010101';
	Иначе
		Период = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();

	//4. Сообщить об отрицательных остатках
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не хватает остатка товара " + Выборка.ТоварПредставление + " в количестве " + Выборка.Дефицит + " шт";
			Сообщение.Сообщить();	
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры       


