
// Обработчик события изменения количества товара в табличной части документа.
//
// Параметры:
//  Элемент - ЭлементФормы - элемент формы, вызвавший событие.
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
    РаботаСДокументамиКлиент.РассчитатьСуммуТабличнойЧасти(СтрокаТабличнойЧасти);
   	РаботаСДокументамиКлиент.ПересчитатьСуммуДокумента(ЭтаФорма);  
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)      
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
    РаботаСДокументамиКлиент.РассчитатьСуммуТабличнойЧасти(СтрокаТабличнойЧасти); 
	РаботаСДокументамиКлиент.ПересчитатьСуммуДокумента(ЭтаФорма);
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РаботаСДокументамиКлиент.ПересчитатьСуммуДокумента(ЭтаФорма);

КонецПроцедуры

