
// Обработчик события изменения количества товара в табличной части документа.
//
// Параметры:
//  Элемент - ЭлементФормы - элемент формы, вызвавший событие.
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
    РаботаСДокументамиКлиент.РассчитатьСуммуТабличнойЧасти(СтрокаТабличнойЧасти);
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
    РаботаСДокументамиКлиент.РассчитатьСуммуТабличнойЧасти(СтрокаТабличнойЧасти);
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма");
	
КонецПроцедуры

