
#Область СлужебныйПрограммныйИнтерфейс 
// Процедура вычисляет сумму строки табличной части документа.
//
// Параметры:
//  СтрокаТабличнойЧасти - Структура - Строка табличной части документа, содержащая реквизиты
//                                       "Количество", "Цена" и "Сумма".
//
// Вычисляет сумму по формуле: Сумма = Количество * Цена. 
&НаКлиенте
Процедура РассчитатьСуммуТабличнойЧасти(СтрокаДанных) Экспорт
	Если Не ЗначениеЗаполнено(СтрокаДанных.Количество) ИЛИ
		Не ЗначениеЗаполнено(СтрокаДанных.Цена) Тогда
		СтрокаДанных.Сумма = 0;
	Иначе
		СтрокаДанных.Сумма = СтрокаДанных.Количество * СтрокаДанных.Цена;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
