// Процедура вычисляет сумму строки табличной части документа.
//
// Параметры:
//  СтрокаТабличнойЧасти - Структура - Строка табличной части документа, содержащая реквизиты
//                                       "Количество", "Цена" и "Сумма".
//
// Вычисляет сумму по формуле: Сумма = Количество * Цена. 
&НаКлиенте
Процедура РассчитатьСуммуТабличнойЧасти(СтрокаТабличнойЧасти) Экспорт

 

	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;

 

КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьСуммуДокумента(Форма) Экспорт
	
	Форма.СуммаВсего = Форма.Объект.Товары.Итог("Сумма");
	
КонецПроцедуры